Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: མོས་པར་དཀའ་བའོ། །འཇུག་པར་དཀའ་བའོ། །བརྗོད་པར་དཀའ་བའོ། །ཁོང་དུ་ཆུད་པར་དཀའ་བ་སྟེ། ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་ཁོང་དུ་ཆུད་པར་མི་ནུས་སོ། །གཞན་དུ་ན་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བ་མ་གཏོགས་ཏེ། གནས་འདི་ནི་སེམས་ཅན་འཁོར་བའི་བདེ་བ་ཐམས་ཅད་ལ་མངོན་པར་འདོད་པ་མེད་པ་དེ་བཞིན་གཤེགས་པའི་བདེ་བ་ལ་ལྷག་པར་དམིགས་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་དང་ཡིད་མི་བདེ་བ་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་ཞུགས་པ། དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་རྒྱ་མཚོ་ལ་འཇུག་པའི་ནན་ཏན་ལ་མངོན་པར་མོས་པ། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པ་ནམ་མཁའི་སྤྱོད་ཡུལ་དང་ལྡན་པ། མོས་པ་ཡངས་པའི་ལམ་གྱིས་རྣམ་པར་དག་པ།
en: She answered, “Noble one, this is a subject that is difficult to believe in, difficult to know, difficult to aspire to, difficult to comprehend, difficult to describe, and difficult to understand; the world and its devas and the śrāvakas and pratyeka­buddhas are unable to comprehend it.

source: འཁོར་བའི་རྒྱུན་ལས་ཕྱིར་ཕྱོགས་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་རྒྱ་མཚོ་ལ་མངོན་པར་མོས་པ་ཆོས་ཀྱི་གྲོང་ཁྱེར་དུ་འགྲོ་བར་གཅིག་ཏུ་ཆད་པ། དེ་བཞིན་གཤེགས་པའི་ཡུལ་ཡོངས་སུ་གནོན་པའི་བརྩོན་འགྲུས་ཅན། སངས་རྒྱས་ཀྱི་སའི་རྒྱུད་རྣམ་པར་གནོན་པ་ཐམས་ཅད་མཁྱེན་པའི་སྟོབས་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་མངོན་པར་མོས་པ། སྟོབས་བཅུ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་མཐར་ཐུག་པ་རྣམས་ཀྱིས་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཡངས་པས་ཉེ་བར་བརྟེན་པའི་སེམས་དང་། བསམ་པ་རྣམ་པར་དག་པ་དང་མ་ཞུམ་པ་དང་། ཉོན་མོངས་པ་མེད་པ་དང་། མ་ཡོ་བ་དང་། མ་ཉམས་པ་དང་། མ་འཆུམས་པ་དང་། མུན་པ་མེད་པའི་སེམས་དང་། ཡེ་ཤེས་ཀྱི་སྣང་བ་ཀུན་ཏུ་སྣང་བས་སྣང་བར་འགྱུར་བའི་སེམས་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བར་བྱ་བར་ཤིན་ཏུ་འདུན་པའི་སེམས་དང་། བདུད་ཀྱི་འཁོར་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་མི་ཐུབ་པའི་སེམས་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཐོབ་པར་བྱ་བར་སྐབས་ཕྱེ་བའི་སེམས་ཀྱིས་ཁོང་དུ་ཆུད་པ་དང་། འཇུག་པ་དང་། ཡིད་ཆེས་པར་བྱ་བ་དང་། གཟུང་བ་དང་རྗེས་སུ་འབྲང་བར་བྱ་བ་འམ།
en: However, through the blessing of the tathāgatas, through being in the care of a kalyāṇamitra, those beings who have no yearning for any bliss in saṃsāra, who are focused on the bliss of the tathāgatas, who are engaged in ending the suffering and unhappiness of all beings, who aspire to the knowledge that comprehends the ocean of the qualities of the tathāgatas, who have realized the nature of all phenomena and have space as their field of activity, who are purified by the path of a vast aspiration, who have turned away from the course of saṃsāra, who aspire to the ocean of wisdom of all the tathāgatas, who are determined to go to the city of the Dharma, who have the diligence to attain the field of activity of the tathāgatas, who have the prowess to reach the level of the buddhas, who aspire to the perfection of the power of omniscience, and who have fully attained the ten strengths, with a mind supported by a vast accumulation of merit and wisdom, with a pure motivation, with a mind that is not disheartened, is not defiled, is not insincere, is unimpaired, has not narrowed, and is not in darkness, with a mind that is illuminated by the light of completely illuminating wisdom, with a mind intent on bringing happiness and benefit to all beings, with a mind that cannot be defeated by the kleśas and all Māra’s entourage, and with a mind that has the opportunity to attain omniscient wisdom, are able to understand, comprehend, believe in, grasp, follow, and know this subject.

source: ཤེས་པར་བྱ་བར་ནུས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Why is that?

source: རིགས་ཀྱི་བུ་གནས་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་ཏེ།
en: Noble one, this subject is the field of the knowledge of the tathāgatas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཀྱང་ཡོངས་སུ་མ་ནོན་ན། སེམས་ཅན་གཞན་ཐམས་ཅད་ཀྱིས་ལྟ་ཅི་ཞིག་སྨོས།
en: All bodhisattvas, let alone all other beings, cannot reach it.

source: འོན་ཀྱང་སེམས་ཅན་ཅང་ཤེས་རྣམས་ཀྱི་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་རྣམ་པར་དག་པར་བྱ་བ་དང་། དགེ་བའི་རྩ་བ་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ཀྱི་ལྷག་པའི་བསམ་པ་དབང་དུ་འགྱུར་བར་བྱ་བ་དང་། ཁྱོད་ཀྱིས་བསམ་པ་ཐག་པ་ནས་ཡོངས་སུ་དྲིས་པའི་ལུང་བསྟན་པའི་ཆོས་ཉིད་རབ་ཏུ་འབྱུང་བ་ཐོབ་པར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བསྟན་ཏོ། །དེ་ནས་མཚན་མོའི་ལྷ་མོ་ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་རྒྱས་པས་བདེ་བར་གནས་པས་དེའི་ཚེ།
en: Nevertheless, through the blessing of the tathāgatas, I teach it so that noble beings will have a perfectly pure motivation, so that beings with a conduct of roots of virtue will have a superior motivation, and so that you will obtain the arising of the true answer to your sincere question.”

source: དོན་དེ་ཉིད་ལ་བརྣན་ཏེ་བསྟན་པའི་ཕྱིར་དུས་གསུམ་དུ་བྱུང་བའི་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་རྣམ་པར་བལྟས་ཏེ། ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །སངས་རྒྱས་སྲས་པོ་ཁྱོད་ཀྱིས་གང་དྲིས་པ། །དེ་ནི་བསམ་ཡས་ཟབ་མོ་སངས་རྒྱས་ཡུལ། །བསམ་ཡས་ཞིང་གི་རྡུལ་ཕྲན་རབ་སྙེད་ཀྱི། །བསྐལ་པ་མང་པོས་དེ་ཀུན་བརྗོད་མྱི་ནུས། །
en: Then, at that time, the night goddess Sarva­vṛkṣpraphullana­sukha­saṃvāsā, in order to teach this meaning further, looking into the field of knowledge of the tathāgatas of the three times, recited these verses: “The profound, inconceivable field of knowledge of the buddhas About which you, son of the buddhas, have asked a question Cannot be entirely explained, even in as many kalpas As there are atoms in countless realms.

source: སེམས་ཅན་འདོད་པའི་སེམས་ལྡན་སྡང་བ་དང་། །དེ་བཞིན་གཏི་མུག་མུན་པས་བསྒྲིབས་པ་དང་། །འཆབ་དང་དྲེགས་པས་བསམ་པ་ཉམས་གྱུར་པས། །རྒྱལ་བའི་ཆོས་ཉིད་ཞི་བ་ཤེས་མི་ནུས། །
en: {1} “Beings who have desiring minds and those with angry minds, And similarly those obscured by the darkness of ignorance And those who are afflicted by hypocrisy and arrogance, Are unable to know the peace of the true nature of the jinas.

source: ཕྲག་དོག་འཇུངས་པའི་དབང་གིས་རྗེས་འབྲང་དང་། །གཡོ་སྒྱུས་བསམ་པ་རྙོགས་པར་གྱུར་པ་དང་། །ཉོན་མོངས་ལས་ཀྱི་སྒྲིབ་པས་བསྒྲིབས་པ་ཡིས། །
en: {2} “Those who are overpowered by and follow envy and jealousy, Those who are polluted by thoughts of deception and deceit, And those who are obscured by the obscuration of kleśas and karma Are unable to know this field of the buddhas.

source: སངས་རྒྱས་ཡུལ་འདི་ཤེས་པར་མི་ནུས་སོ། །ཕུང་པོ་ཁམས་དང་སྐྱེ་མཆེད་གནས་པ་དང་། །འཇིག་ཚོགས་མང་ལ་གནས་པར་གྱུར་པ་དང་། །ལྟ་སེམས་འདུ་ཤེས་ཕྱིན་ཅི་ལོག་གྱུར་པས། །
en: {3} “Those who are established in the skandhas, dhātus, and āyatanas, Those who are dependent on the destructible accumulation, And those whose minds and views are aberrant Are unable to know this level of the buddhas.

source: ཞི་བའི་ས་འདི་ཤེས་པར་མི་ནུས་སོ། །རྒྱལ་བའི་ཡུལ་ནི་ཤེས་དཀའ་ཞི་བ་སྟེ། །
en: {4} “The field of the jinas is a peace that is difficult to comprehend.

source: རང་བཞིན་དྲི་མེད་རྣམ་པར་རྟོག་པ་མེད། །
en: Its nature is stainless, and it is without conceptualization.

source: སྲིད་པར་རྟེན་ཅིང་འཁོར་ལ་ཆགས་པ་ཡིས། །ཆོས་འདི་ཡང་དག་ཤེས་པར་མི་ནུས་སོ། །
en: Those who are dependent on existence and cling to saṃsāra Are not able to know this Dharma.

source: སངས་རྒྱས་རིགས་སུ་རིགས་ལྡན་གང་སྐྱེས་པ། །དེ་བཞིན་གཤེགས་པ་ཀུན་གྱིས་བྱིན་བརླབས་ཤིང་། །ཆོས་ཀྱི་རྒྱལ་པོའི་གདུང་རབས་ཡོངས་འཛིན་པ། །དྲང་སྲོང་དེ་དག་ཡུལ་ནི་འདི་ཡིན་ནོ། །
en: {5} “This is the field for those ṛṣis Of the family and born in the family of the buddhas, Who have been consecrated by all the tathāgatas And are holders of the lineage of the Dharma king.

source: དཀར་ཆོས་རྒྱ་མཚོས་མི་ངོམས་སེམས་ལྡན་ཞིང་། །གང་རྣམས་དགེ་བའི་བཤེས་ཀྱིས་ཡོངས་བཟུང་སྟེ། །ཐུབ་པའི་སྟོབས་ལ་དམིགས་པའི་སེམས་སྤྲིན་ཅན། །དེ་དག་འདི་ཐོས་བཟོད་པ་ཐོབ་པར་འགྱུར། །
en: {6} “Those who are never satisfied by an ocean of good qualities, Who have been taken into the care of kalyāṇamitras, And who have a cloud of aspiration focused on the strengths of the munis Attain peace when they hear this.

source: གང་རྣམས་བསམ་པ་དྲི་མེད་རྣམ་རྟོག་མེད། །བར་སྣང་མཁའ་བཞིན་ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ། །མུན་པ་རྣམ་བསལ་བློ་གྲོས་སྒྲོན་མའི་སྤྲིན། །དྲི་མེད་དེ་དག་སྤྱོད་ཡུལ་འདི་ཡིན་ནོ། །
en: {7} “Those who have stainless, nonconceptual motivation, Whose understanding is like a cloud of lamps ending darkness— Those stainless ones have this field of activity Throughout the main and intermediate directions, to the extent of space.

source: སྙིང་རྗེའི་བསམ་པས་འགྲོ་བ་རྒྱ་མཚོ་རྣམས། །དུས་གསུམ་བྱུང་བ་གང་རྣམས་རྒྱས་བྱེད་ཅིང་། །
en: {8} “They who have a motivation of compassion for the ocean of beings— Their presence pervades the entire three times.

source: སེམས་ཅན་མ་ལུས་རྗེས་འབྲང་བྱམས་པ་ཅན། །དེ་དག་རྒྱལ་བའི་ཚུལ་འདིར་འཇུག་པར་འགྱུར། །
en: They follow every single being with love, Entering this way of the jinas.

source: གང་རྣམས་འཛིན་མེད་དགའ་བའི་སེམས་ལྡན་ཞིང་། །རྟག་པར་བདོག་པ་ཐམས་ཅད་སྦྱིན་བརྩོན་ལ། །
en: {9} “Those who have a rapturous mind that is free of grasping Are constantly dedicated to giving away everything.

source: སེམས་ཅན་ཀུན་ལ་མཉམ་པར་ཞུགས་གྱུར་པ། །ཆགས་མེད་དེ་དག་སྤྱོད་ཡུལ་ས་འདི་ཡིན། །
en: They engage in activity with all beings equally And have no attachment to this level of conduct.

source: ཉོན་མོངས་མེད་སེམས་སྐྱོན་མེད་སྤྱོད་ལྡན་ཞིང་། །གང་རྣམས་འགྱོད་པ་རྣམ་བསྩལ་སེམས་ལྡན་ཏེ། །སངས་རྒྱས་གདམས་ངག་ནན་ཏན་བྱེད་ལྡན་པ། །དྲི་མེད་དེ་དག་སྤྱོད་ཡུལ་འདི་ཡིན་ནོ། །
en: {10} “Those who are without defilements, with conduct free of transgressions, Who are dedicated to practicing the teaching of the buddhas And whose minds have repentance of wrongdoing— Those stainless ones have this field of activity.

source: གང་རྣམས་མི་སྒུལ སེམས་ལྡན་མི་བསྐྱོད་སེམས། །ཆོས་ཀྱི་རང་བཞིན་རྟོགས་པའི་སེམས་ལྡན་ཞིང་། །ལས་ཀྱི་རྒྱ་མཚོར་མི་འགལ་སེམས་ལྡན་པ། །མི་ཟད་དེ་དག་རྣམ་ཐར་འདི་ཡིན་ནོ། །
en: {11} “Those who have unshakable, steadfast minds, Whose minds have realized the nature of phenomena, Who have minds unhindered by an ocean of karma— For them this liberation is inexhaustible.

source: གང་རྣམས་མི་སྐྱེའི་སེམས་དང་མི་ལྡོག་སེམས། །བརྩོན་འགྲུས་མཐུ་དང་རྩལ་དུ་ལྡན་པ་རྣམས། །ཐམས་ཅད་མཁྱེན་ཚོགས་བརྩོན་འགྲུས་མཐའ་ཡས་པ། །བརྟུལ་ཞུགས་བཟང་ལྡན་དེ་དག་ཡུལ་འདི་ཡིན། །
en: {12} “For those with minds that are never disheartened, never turn back, Those who have strong and powerful diligence, With endless diligence for the accumulation of omniscience— For those with excellent discipline, there is this field of activity.

source: ཞི་བའི་སེམས་ལྡན་མཉམ་པར་བཞག་པ་གང་། །ཤིན་ཏུ་ཞིར་གྱུར་རིམས་དང་བྲལ་བ་རྣམས། །ཀུན་མཁྱེན་བསམ་གཏན་ཡན་ལག་མཚོར་སྤྱོད་པ། །རབ་ཏུ་ཞི་བ་དེ་དག་ཚུལ་འདི་ཡིན། །
en: {13} “Those with minds of peace, minds at rest, Who are in complete peace, unfevered, Practicing an ocean of omniscient dhyāna— For those who have become peaceful, there is this way.

source: གང་རྣམས་ཆགས་པ་ཀུན་ལས་སེམས་གྲོལ་ཞིང་། །ཆོས་ཀྱི་རང་བཞིན་ཁོང་དུ་ཆུད་སེམས་ཅན། །རྒྱལ་བའི་ཆོས་དབྱིངས་རྟོགས་པ་ཁོང་ཆུད་པ། །ཤེས་རབ་སྒྲོན་མ་དེ་དག་ཚུལ་འདི་ཡིན། །
en: {14} “Those whose minds are freed from all attachment, Whose minds have understood the nature of phenomena, Who have realized the Dharma realm of the jinas— For those who are lamps of wisdom, there is this way.

source: སེམས་ཅན་རང་བཞིན་རྟོགས་སེམས་ལྡན་གྱུར་ཅིང་། །གང་རྣམས་སྲིད་པའི་མཚོ་ལ་ཆགས་མེད་སེམས། །སེམས་ཅན་སེམས་ལ་གཟུགས་བརྙན་ཟླ་འཆར་བ། །ལམ་མཁན་དེ་དག་རྣམ་ཐར་འདི་ཡིན་ནོ། །
en: {15} “Those whose minds have realized the nature of beings, Whose minds have no attachment to the ocean of existence, Who appear to the minds of beings like the reflections of the moon— For those who are wise in the path, there is this liberation.

source: དུས་གསུམ་བྱུང་བའི་རྒྱལ་བ་རྒྱ་མཚོ་རྣམས། །སྨོན་ལམ་གང་ཆེན་མཚོ་རྒྱུད་སྐྱེས་པ་ཡི། །ཞིང་རྣམས་ཀུན་ཏུ་ཕྱི་མའི་མཐར་སྤྱོད་པ། །ཀུན་ཏུ་བཟང་པོ་དེ་དག་ཚུལ་འདི་ཡིན། །
en: {16} “Those who practice in all future realms That arise from the ocean of the family of prayers Of the ocean of jinas who are in the three times— For those who are completely good, there is this way.

source: གང་རྣམས་ཆོས་དབྱིངས་ཚུལ་རྣམས་རྒྱ་མཚོ་ཡིས། །འགྲོ་བ་རྒྱ་མཚོ་འདུ་དང་འཇིག་པ་ཡི། །བསྐལ་པར་བཅས་པ་ཁོང་དུ་ཆུད་པའི་རྣམས། །རྟོག་མེད་དེ་དག་རྣམ་ཐར་འདི་ཡིན་ནོ། །
en: {17} “Those who through an ocean of the ways of the realm of Dharma Enter into the entire ocean of worlds In all the kalpas of creation and destruction— For those who are free of conceptualization, there is this liberation.

source: ཞིང་རྣམས་ཀུན་གྱི་རྡུལ་ཕྲན་ཐམས་ཅད་ལ། །སངས་རྒྱས་གྲངས་མེད་ཤིང་རྒྱལ་དྲུང་བཞུགས་ཤིང་། །བྱང་ཆུབ་འཚང་རྒྱ་འགྲོ་འདུལ་མཐོང་བ་ཡི། །ཆགས་མེད་མིག་ཅན་དེ་དག་ཚུལ་འདི་ཡིན། །
en: {18} “Those who see, in the atoms of the realms in all directions, Countless buddhas at the foot of the kings of trees Attaining enlightenment and guiding beings— For those with vision free of attachment, there is this way.

source: ཁྱོད་ནི་བསྐལ་པ་རྒྱ་མཚོ་རྒྱ་ཆེན་དུ། །དགེ་བའི་བཤེས་གཉེན་མང་པོ་བསྙེན་བཀུར་ཏེ། །ཆོས་འདོད་ཆོས་ཚོལ་མི་སྐྱོ་འདིར་ཕྱིན་པས། །
en: {19} “You have served kalyāṇamitras Through a great ocean of kalpas And so have come here, unwearyingly seeking the Dharma.

source: ཐོས་ནས་དེ་ནི་ཡོངས་སུ་གཟུང་བར་ནུས། །
en: You are able to hold this when you have heard it.

source: ཁྱོད་ཀྱི་བསམ་པ་ཡོངས་སུ་སྦྱང་བའི་ཕྱིར། །བདེ་གཤེགས་བྱིན་རླབས་བསམ་གྱིས་མི་ཁྱབ་པས། །རྣམ་པར་སྣང་མཛད་ཚད་མེད་ཡུལ་འདི་ཡང་། །ཁོ་མོའི་ཚིག་ལས་ཆགས་པ་མེད་པར་འབྱུང་། །
en: {20} “In order to purify your motivation, Through the inconceivable blessing of the sugatas This immeasurable field of Vairocana Will arise without impediment from my words.

source: རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་བསྐལ་པ་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་དེའི་ཡང་ཕ་སྔ་ཞིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་གསེར་རིན་པོ་ཆེའི་རི་སྤོ་རྣམ་པར་སྣང་བ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: {21} “Noble one, in a time in the past even beyond as many kalpas as there are atoms in a world realm, there was an ocean of world realms called Maṇi­kanaka­parvata­śikhara­vairocana.

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་གསེར་རིན་པོ་ཆེའི་རི་སྤོ་རྣམ་པར་སྣང་བ་དེར་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རི་བོའི་འོད་ཆོས་ཀྱི་དབྱིངས་སུ་སྣང་བའི་གཟི་བརྗིད་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “Noble one, in that ocean of world realms called Maṇi­kanaka­parvata­śikhara­vairocana there was a tathāgata by the name of Jñāna­parvata­dharma­dhātu­dikpratapana­tejorāja.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རི་བོའི་འོད་ཆོས་ཀྱི་དབྱིངས་སུ་སྣང་བའི་གཟི་བརྗིད་རྒྱལ་པོ་དེ། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་གསེར་རིན་པོ་ཆེའི་རི་སྤོ་རྣམ་པར་སྣང་བ་ཞེས་བྱ་བ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོའི་ས་དང་།
en: The Tathāgata Jñāna­parvata­dharma­dhātu­dikpratapana­tejorāja, through his previous bodhisattva conduct, had purified the ocean of world realms called Maṇi­kanaka­parvata­śikhara­vairocana.

source: རི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་བསྟན་དུ་ཡོད་པ་དང་ལྡན་པ།
en: “In that ocean of world realms called Maṇi­kanaka­parvata­śikhara­vairocana appeared as many ranges of world realms as there are atoms in the earth and the mountains.

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་རེ་རེ་ཞིང་ཡང་བསྐལ་པའི་གྲངས་ཤིན་ཏུ་བསྟན་པ་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་ལྡན་པ་བསྐལ་པ་རེ་རེ་ཞིང་ཡང་བསྐལ་པ་བར་མ་ཤིན་ཏུ་བསྟན་པ་དུ་མ་དང་ལྡན་པ་བསྐལ་བ་བར་མ་རེ་རེ་ཞིང་ཡང་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པ་ཐ་དད་དུ་བྱ་བ་བསྟན་པ་དུ་མ་དང་ལྡན་པ།
en: In each range of world realms appeared as many groups of world realms as there are atoms in a multitude of world realms. In each world realm appeared as many kalpas as there are atoms in a world realm. In each kalpa appeared numerous intermediate kalpas. In each intermediate kalpa appeared numerous world realms with different appearances.

source: དེ་བཞིན་གཤེགས་པ་འབྱུང་བ་དང་། རྫུ་འཕྲུལ་སྣ་ཚོགས་བསྟན་དུ་ཡོད་པ་དེ་བཞིན་གཤེགས་པ་འབྱུང་བ་རེ་རེ་ཞིང་ཡང་མདོ་སྡེ་ཡང་དག་པར་བསྟན་པ།
en: In those appeared various occurrences of tathāgatas and their miraculous manifestations.

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བརྗོད་དུ་ཡོད་པ་མདོ་སྡེ་རེ་རེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ལུང་བསྟན་པ།
en: During each appearance of a buddha appeared as many sūtras as there are atoms in a world realm.

source: འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བསྟན་དུ་ཡོད་པ་སེམས་ཅན་འདུལ་བ་མཐའ་དང་དབུས་མེད་པ་ཤིན་ཏུ་བསྟན་པ།
en: Within each sūtra appeared as many prophecies to bodhisattvas as there are atoms in a world realm.

source: ཐེག་པ་ཐ་དད་པའི་ཚུལ་གྱིས་བསྒྲུབས་པ། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་ཆོ་འཕྲུལ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་འདུལ་བ་དང་ལྡན་པ་ཡོངས་སུ་སྦྱངས་ཏེ།
en: There appeared a vast extent of guided beings, without edge or center, accomplishment through the ways of various yānas, and guidance through various miraculous manifestations.

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་གསེར་རིན་པོ་ཆེའི་རི་སྤོ་རྣམ་པར་སྣང་བ་དེར།
en: “Noble one, in that ocean of world realms called Maṇi­kanaka­parvata­śikhara­vairocana there was a central group of world realms called Samanta­digabhimukha­dvāra­dhvaja­vyūha.

source: འཇིག་རྟེན་གྱི་ཁམས་བར་མའི་རྒྱུད་ཕྱོགས་ཀུན་ཏུ་མངོན་པར་བལྟས་པའི་སྒོ་རྒྱལ་མཚན་གྱིས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “Noble one, in that central group of world realms called Samanta­digabhimukha­dvāra­dhvaja­vyūha there was the world realm called Sarva­ratna­varṇa­samanta­prabhāsa­śrī.

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་བར་མའི་རྒྱུད་ཕྱོགས་ཀུན་ཏུ་སྒོ་མངོན་པར་བལྟས་པ་རྒྱལ་མཚན་གྱིས་རྣམ་པར་བརྒྱན་པ་དེར། འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་མདོག་ཀུན་ཏུ་སྣང་བའི་དཔལ་ཞེས་བྱ་བ་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཞི་དང་།
en: “It had a display of basis and borders of world realms.

source: མཚམས་ཀྱི་རྒྱན་རིན་པོ་ཆེའི་རྒྱལ་པོ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་རབ་ཏུ་སྣང་བ་ལས་བྱས་པ།
en: It had the shining bodhimaṇḍas of all the tathāgatas that were made of kings of jewels.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་རྒྱ་མཚོ་ལ་གནས་པ།
en: It resided upon an ocean of flowers of various jewels.

source: ལྷུན་རིན་པོ་ཆེའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྲུལ་པའི་གཟུགས་བརྙན་རབ་ཏུ་སྟོན་པ་ལས་བསྒྲུབས་པ།
en: Its main mass was made of kings of precious jewels in which appeared the images of the emanations of all the tathāgatas.

source: ལྷའི་གྲོང་ཁྱེར་གྱི་དབྱིབས་སུ་འདུག་པ་རྣམ་པར་དག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པ་བྱུང་བར་གྱུར་ཏེ།
en: It had the form of a city of devas. It was both pure and defiled.

source: འཇིག་རྟེན་གྱི་ཁམས་དེར་གླིང་བཞི་བའི་འཇིག་རྟེན་གྱི་ཁམས་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་བར་གྱུར་ཏོ། །
en: “In that world realm there were as many four-continent world realms as there are atoms in Sumeru.

source: གླིང་བཞི་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་པོ་དེ་དག་གི་གླིང་བཞི་པ་དབུ་མ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྩེ་མོའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: The central four continents among those four continents that were as numerous as the atoms in Sumeru was called Sarva­ratna­śikhara­dhvaja.

source: གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྩེ་མོའི་རྒྱལ་མཚན་དེར་གླིང་ཆུ་ཞེང་དུ་དཔག་ཚད་བརྒྱ་ཕྲག་སྟོང་ཡོད་པ་བཞི་བྱུང་ནས་གླིང་རེ་རེར་ཡང་གྲོང་ཁྱེར་ཆེན་པོ་སྟོང་ཕྲག་རེ་རེ་བྱུང་ངོ་། །
en: In that four-continent world called Sarva­ratna­śikhara­dhvaja, each of the four continents was a hundred thousand yojanas wide. In each of those continents there were a thousand great cities.

source: གླིང་བཞི་པ་དེའི་འཛམ་བུ་གླིང་གི་དབུས་སུ་རྒྱལ་པོའི་གནས་རིན་པོ་ཆེའི་ས་ལས་རྣམ་པར་བརྒྱན་པ། སྤྲིན་གྱི་སྒྲོན་མ་ཞེས་བྱ་བ་གྲོང་ཁྱེར་སྟོང་ཕྲག་བཅུའི་འཁོར་དང་ལྡན་པ་བྱུང་ངོ་། །
en: In the center of the Jambudvīpa of that four-continent world there was a royal capital called Ratna­sāla­vyūha­megha­pradīpā, which was encircled by ten thousand cities.

source: དེའི་ཚེ་འཛམ་བུའི་གླིང་དེའི་མྱི་རྣམས་ཀྱང་ཚེའི་ཚད་ལོ་སྟོང་ཕྲག་བཅུ་ཐུབ་པར་གྱུར་ཏོ། །
en: “At that time, the people of that Jambudvīpa had a lifespan of ten thousand years.

source: རྒྱལ་པོའི་གནས་རིན་པོ་ཆེའི་ས་ལས་རྣམ་པར་བརྒྱན་པ་སྤྲིན་གྱི་སྒྲོན་མ་དེར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: In the royal capital called Ratna­sāla­vyūha­megha­pradīpā there was a cakravartin king by the name of Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་དེའི་བློན་པོ་ནི་ལྔ་བརྒྱ་བྱུང་ངོ་། །
en: The cakravartin king Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa had five hundred ministers.

source: བཙུན་མོ་ནི་སྟོང་ཕྲག་དྲུག་ཅུ་བྱུང་ངོ་། །
en: He had sixty thousand queens.

source: སྲས་ནི་ཀུན་ཀྱང་དཔའ་བ་བརྟུལ་ཕོད་པ། ཡན་ལག་དམ་པའི་གཟུགས་དང་ལྡན་པ། བལྟ་ན་སྡུག་པ་གཟི་བརྗིད་ཆེ་བ། སྟོབས་ཆེ་བ་བརྒྱ་ཕྲག་བདུན་བྱུང་ངོ་། །
en: He had seven hundred sons who were all courageous and heroic, with perfectly formed bodies, handsome and magnificent, and very strong.

source: རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་དེའི་ཚེ་ལ་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཀྱང་གདུགས་གཅིག་གིས་བསྐྱངས་པར་གྱུར་ཏེ། ཕ་རོལ་གྱི་འཁོར་དང་དགྲ་ཐམས་ཅད་ཀྱང་ཤིན་ཏུ་ཆོམས་པར་གྱུར་ཏོ། །
en: “During the time of King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa, he protected all of Jambudvīpa under one parasol and vanquished all enemies and opponents.

source: དེའི་ཚེ་འཇིག་རྟེན་གྱི་ཁམས་དེར་བསྐལ་པ་བར་མ་ནི་ཟད་དུ་ཆ། རྙོག་པ་ལྔ་ནི་འཇིག་རྟེན་དུ་བྱུང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ནི་ནུབ་པར་གྱུར་ནས། སེམས་ཅན་མི་དགེ་བ་བཅུའི་ལམ་ལ་སྤྱོད་པ་ཕལ་ཆེར་ངན་སོང་དུ་ཡང་འདོང་བར་གྱུར་ཏོ། །
en: During that time, in that world realm, as the intermediate kalpa was ending, the five degenerations appeared, the path of the ten good actions vanished, beings practiced the path of the ten bad actions, and most went to the lower realms.

source: དེ་དག་མྱི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་འཛིན་པའི་རྒྱུས་ཚེ་ཐུང་བ་དང་ལོངས་སྤྱོད་ཆུང་བ་དང་གཟུགས་མ་ལེགས་པ་དང་། ཁ་དོག་མི་སྡུག་པ་དང་། ལུས་མ་ལེགས་པ་དང་།
en: Their following the path of bad actions became the cause for lifespans to become short, pleasures to be few, and bodies to be ugly, have a bad color, and be misshapen.

source: བདེ་བའི་རྣམ་པ་ཉུང་བ་དང་། སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བའི་རྣམ་པ་མང་བ་དང་།
en: There was little happiness and the experience of many kinds of suffering.

source: ཕན་ཚུན་བསླུ་ཞིང་འདྲིད་པའི་རང་བཞིན་ཅན་དང་།
en: They deceived and betrayed one another.

source: ཕན་ཚུན་དབྱེ་བ་ལ་ཞུགས་པ་དང་།
en: They caused divisions between one another.

source: ཞེ་གཅོད་པའི་ཚིག་ལ་སྤྱོད་པ་དང་།
en: They engaged in harsh speech.

source: འཆལ་བའི་ཚིག་ཏུ་སྨྲ་བ་དང་།
en: They spoke incoherently.

source: འདོད་པ་མི་བཟད་པས་ཟིལ་གྱིས་གནོན་པ་དང་།
en: They were overcome by overpowering desires.

source: ཞེ་སྡང་བའི་ཡིད་ཀྱི་རྟོག་པ་དང་ལྡན་པ་དང་།
en: They had the thoughts of angry minds.

source: ལྟ་བའི་ཐིབས་པོ་སྣ་ཚོགས་ཀྱི་མྱ་ངམ་དུ་འཁྱམས་པར་གྱུར་ནས།
en: They wandered in a wilderness of various thickets of wrong views.

source: དེ་དག་ཆོས་མ་ཡིན་པའི་འདོད་ཆགས་ལ་ཞེན་ཅིང་འདོད་པ་མི་བཟད་པས་ཟིལ་གྱིས་ནོན་ལ།
en: They clung to desires that were contrary to the Dharma, and they were overcome by those overpowering desires.

source: ལོག་པའི་ཆོས་ཀྱིས་ཀུན་ནས་འཁོར་བས་ས་ལ་ཤིང་རྩི་དང་།
en: They were encompassed by false Dharma. Therefore, trees, plants, and harvests of food did not grow from the ground.

source: ལོ་ཟས་སྐྱེ་བར་འགྱུར་བའི་ཆར་ཡང་དུས་སུ་མི་འབབ་པར་གྱུར་ཏེ།
en: The rain did not come on time.

source: སེམས་ཅན་དེ་དག་ཀྱང་རྩྭ་དང་གེལ་པ་དང་སྨན་དང་ནགས་ཚལ་དང་། བཟའ་ཤིང་གི་ར་བ་དང་སྡོང་པོ་དག་ཀྱང་སྐམས་པར་གྱུར་ནས།
en: For those beings, the grass, herbs, shrubs, forests, orchards, and trees withered.

source: ནད་སྣ་ཚོགས་ཀྱིས་ཐེབས་ཤིང་ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་སྐྱབས་མེད་པས།
en: They were afflicted by various illnesses.

source: ཕན་ཚུན་ཁོད་མི་མྱོང་ཞིང་གཡེན་སྦྱོར་བར་གྱུར་ཏེ།
en: Throughout the main and intermediate directions they had no protector, and so they disrespected and were in contention with one another.

source: དེ་དག་ཀུན་ཀྱང་གཅིག་ཏུ་འདུས་ནས་རྒྱལ་པོའི་གནས་རིན་པོ་ཆེའི་ས་ལས་རྣམ་པར་བརྒྱན་པ་སྤྲིན་གྱི་སྒྲོན་མ་གང་ན་བ་དེར་དོང་སྟེ། ཀུན་ནས་བསྐོར་ནས། ལ་ལ་ནི་ལག་པ་གྱེན་དུ་སྒྲེང་། ལ་ལ་ནི་ཐལ་མོ་སྦྱོར། ལ་ལ་ནི་ལུས་ཤིན་ཏུ་འདར། ལ་ལ་ནི་གྱེད། ལ་ལ་ནི་བུབ།
en: “They all gathered together and went to the royal capital Ratna­sāla­vyūha­megha­pradīpā.

source: ལ་ལ་ནི་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་ཅིང་ཕྱག་འཚལ། ལ་ལ་ནི་པུས་མོ་ས་ལ་འཛུགས། ལ་ལ་ནི་ལག་པ་ནམ་མཁའི་དབྱིངས་སུ་གཡོ་བ། ལ་ལ་ནི་གོས་མེད་ཅིང་སྒྲེན་མོར་འཁོད། ལ་ལ་ནི་ཁ་མིག་མྱི་སྡུག་པར་གྱུར་ཅིང་།
en: They surrounded it, some with their arms upraised, some with hands clasped together, some with their bodies trembling, some collapsing, some falling with their heads on the ground, some with their bodies stretched out on the ground prostrate, some kneeling, some waving their arms in the air, some naked without clothes, some with an ugly expression of the face and eyes.

source: རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་ལ་མངོན་ཏུ་བལྟས་ཤིང་། སྙིང་རྗེ་སྐད་དུ་འོ་དོད་ཆེན་པོ་འབོད་དེ།
en: They stared at King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa and cried out in a great piteous clamor, ‘Your Majesty!
